In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [5]:
pd.merge(logins,registrations,how='outer',on='name')

   log_id     name  reg_id
0     2.0   Andrew     1.0
1     4.0     Bobo     2.0
2     NaN   Claire     3.0
3     NaN    David     4.0
4     1.0   Xavier     NaN
5     3.0  Yolanda     NaN

In [7]:
registrations = registrations.set_index('name')

In [8]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [9]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [12]:
pd.merge(registrations,logins,left_index=True,right_on='name',how='inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [13]:
registrations = registrations.reset_index()

In [15]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [16]:
registrations.columns=['reg_name','reg_id']

In [17]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [19]:
results = pd.merge(registrations,logins,left_on='reg_name',right_on='name',how='inner')

In [20]:
results.drop('reg_name',axis=1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [28]:
registrations.columns=['name','id']
logins.columns=['id','name']

In [29]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [30]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [32]:
pd.merge(registrations,logins,on='name',how='inner',suffixes=('_reg','_log'))

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4